foam-v2312/benchmarkcase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cyclicBuoyantFlow;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

libs
(
    "libfieldFunctionObjects.so"
    "libUtilityFunctionObjects.so"
);

functions
{
    calc_psi
    {
        libs ( utilityFunctionObjects );
        type coded;
        name calc_psi;
        enabled yes;

        codeExecute
        #{
            const auto& vel =
                mesh().lookupObject<volVectorField>("U");

            label patchID = mesh().boundaryMesh().findPatchID("bottom");

            dimensionedScalar psi
            (
                "psi",
                dimensionSet(0, 2, -1, 1, 0, 0, 0),
                gSum(vel.boundaryField()[patchID].component(1)*mesh().magSf().boundaryField()[patchID])/gSum(mesh().magSf().boundaryField()[patchID])
            );
              
            Info << "psi: " << psi.value() << endl;
        #};
    }
}

// ************************************************************************* //
